# Data cleaning and merging

- In this notebook, we will clean the data and merge the data from the different datasets.

## Client Profiles (client_profiles.csv)

In [1]:
#import libraries to clean data and do the merging

import pandas as pd
import numpy as np

#read the data

client_profiles = "/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_final_demo.csv"
digital_footprints_1 = "/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_final_web_data_pt_1.csv"
digital_footprints_2 = "/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_final_web_data_pt_2.csv"
experiment_roster = "/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_final_experiment_clients.csv"

#read the data

df_client_profiles = pd.read_csv(client_profiles)

df_client_profiles.sample(5)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
25024,4044961,9.0,115.0,38.5,F,2.0,36135.75,3.0,6.0
36557,2417474,15.0,187.0,71.5,M,2.0,47061.79,0.0,3.0
39257,3535575,8.0,104.0,29.5,F,2.0,34932.82,0.0,3.0
20036,8216174,12.0,154.0,61.0,M,2.0,116661.20,0.0,3.0
29708,7114316,14.0,168.0,35.5,F,2.0,58186.67,1.0,4.0

In [2]:
# handling different values on gendr

df_client_profiles.gendr.value_counts()

# includint the X values in U

df_client_profiles['gendr'] = df_client_profiles['gendr'].replace('X', 'U')

df_client_profiles.gendr.value_counts()

gendr
U    24125
M    23724
F    22746
Name: count, dtype: int64

In [3]:
df_client_profiles.shape

(70609, 9)

In [4]:
df_client_profiles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [5]:
# checking for missing values

df_client_profiles.isnull().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [6]:
# drop the missing values

df_client_profiles = df_client_profiles.dropna()

df_client_profiles.isnull().sum()

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [7]:
df_client_profiles['clnt_tenure_yr'] = df_client_profiles['clnt_tenure_yr'].astype(int)
df_client_profiles['clnt_tenure_mnth'] = df_client_profiles['clnt_tenure_mnth'].astype(int)
df_client_profiles['clnt_age'] = df_client_profiles['clnt_age'].astype(int)
df_client_profiles['calls_6_mnth'] = df_client_profiles['calls_6_mnth'].astype(int)
df_client_profiles['logons_6_mnth'] = df_client_profiles['logons_6_mnth'].astype(int)
df_client_profiles['num_accts'] = df_client_profiles['num_accts'].astype(int)

df_client_profiles.sample(5)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
52348,3518240,15,191,33,U,2,31989.01,7,7
65752,9939987,7,85,38,U,2,20453.11,4,4
60241,4489790,20,249,31,M,3,180709.95,6,6
16848,8829608,16,192,58,M,3,638185.61,6,9
43393,9442411,6,78,47,U,3,53580.06,2,5

In [8]:
# checking for duplicates   

duplicates = df_client_profiles.duplicated()

duplicates.sum()

0

### Merging the digital_footprints_1 and digital_footprints_2 datasets before cleaning

In [9]:
# Load the datasets

df_digital_footprint1 = pd.read_csv(digital_footprints_1)
df_digital_footprint2 = pd.read_csv(digital_footprints_2)

# Convert date_time columns to datetime format

df_digital_footprint1['date_time'] = pd.to_datetime(df_digital_footprint1['date_time'])
df_digital_footprint2['date_time'] = pd.to_datetime(df_digital_footprint2['date_time'])

# Merge the datasets

df_digital_footprint = pd.concat([df_digital_footprint1, df_digital_footprint2])

# Display a sample the merged dataset

df_digital_footprint.sample(5)

,client_id,visitor_id,visit_id,process_step,date_time
281246,6043425,362482002_83909183591,143420461_3381335558_645061,start,2017-06-04 20:33:58
328852,6207137,351584592_4788503001,995286943_88012837597_530942,start,2017-04-21 14:16:59
249956,5058631,859569947_40827061718,447661008_75111507967_393816,start,2017-04-15 13:40:46
16674,549586,575352869_38998546801,202868821_88723542910_786372,step_1,2017-05-30 15:09:29
246876,673939,163039120_25243113722,424288451_98732788933_283744,step_3,2017-04-12 16:09:07

In [10]:
# checking for missing values

df_digital_footprint.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [11]:
df_digital_footprint.shape

(755405, 5)

In [12]:
# duplicates

duplicates = df_digital_footprint.duplicated()

duplicates.sum()

10764

In [13]:
#show duplicates for the same client_id

df_digital_footprint[df_digital_footprint.duplicated(subset=['client_id', 'date_time'], keep=False)].sort_values(by=['client_id', 'date_time'])

,client_id,visitor_id,visit_id,process_step,date_time
288214,1531,934069404_34543643308,110350144_67985219545_904677,start,2017-06-02 22:32:08
288215,1531,934069404_34543643308,110350144_67985219545_904677,start,2017-06-02 22:32:08
288212,1531,934069404_34543643308,110350144_67985219545_904677,start,2017-06-02 22:32:28
288213,1531,934069404_34543643308,110350144_67985219545_904677,start,2017-06-02 22:32:28
296388,2078,585735301_21309149782,900598259_99565669243_552843,start,2017-05-06 08:29:00
...,...,...,...,...,...
119532,9998346,292425655_16607136645,189177304_69869411700_783154,step_3,2017-03-29 15:37:28
119533,9998346,292425655_16607136645,189177304_69869411700_783154,confirm,2017-03-29 15:37:28
119534,9998346,292425655_16607136645,189177304_69869411700_783154,step_3,2017-03-29 15:37:28
63673,9998447,747535871_38029188908,309540451_47388672022_606106,start,2017-06-03 19:17:15
63674,9998447,747535871_38029188908,309540451_47388672022_606106,start,2017-06-03 19:17:15

In [14]:
# checking duplicates when all columns are equal

duplicates = df_digital_footprint.duplicated()

duplicates.sum()

10764

In [15]:
# Since we are dealing with genuine duplicates, we will drop them  

df_digital_footprint = df_digital_footprint.drop_duplicates()

df_digital_footprint.shape

(744641, 5)

### Experiment Roster (final_experiment_clients.csv)

In [16]:
#load the experiment roster

df_experiment_roster = pd.read_csv(experiment_roster)

df_experiment_roster.sample(5)

       client_id Variation
14017      68276      Test
59738    3234001       NaN
25227    2941236      Test
38267    6697214      Test
336      2532775      Test

In [17]:
df_experiment_roster.shape

(70609, 2)

In [18]:
# checking for missing values

df_experiment_roster.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [19]:
# checking values for the column variation

df_experiment_roster.Variation.value_counts()

Variation
Test       26968
Control    23532
Name: count, dtype: int64

In [20]:
# checking for duplicates

duplicates = df_experiment_roster.duplicated()

duplicates.sum()

0

In [21]:
# checking if we have repeated client_ids

df_experiment_roster['client_id'].duplicated().sum()

0

In [22]:
# Dropping missing values

df_experiment_roster = df_experiment_roster.dropna()

df_experiment_roster.isnull().sum()

client_id    0
Variation    0
dtype: int64

## Merging the 3 datasets (client_profiles.csv, digital_footprints.csv, final_experiment_clients.csv)

In [23]:
# Merging the 3 datasets

df_client_profiles

df_digital_footprint

df_experiment_roster

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
50495     393005   Control
50496    2908510   Control
50497    7230446      Test
50498    5230357      Test
50499    6334360      Test

[50500 rows x 2 columns]

In [24]:
# Merge df_experiment_clients_cleaned with df_demo_cleaned

df_merged = pd.merge(df_client_profiles, df_experiment_roster, on='client_id', how='inner')

In [31]:
# Merge the result with df_web_data_cleaned

df_merged_final = pd.merge(df_merged, df_digital_footprint, on='client_id', how='inner')

df_merged_final.sample(5)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation,visitor_id,visit_id,process_step,date_time
83850,7942902,4,59,54,U,3,83533.54,6,9,Test,451202168_48875025723,63634905_53734855468_699323,start,2017-05-29 14:46:11
175666,2145511,25,306,30,U,2,47466.69,2,5,Control,340937991_32828124706,220188226_65609660856_213802,step_1,2017-04-06 14:50:31
90928,5618153,6,83,50,U,2,40459.77,6,9,Control,275392897_48011238512,212921119_17732189125_428539,step_3,2017-04-07 09:56:23
308355,5301174,28,340,70,F,3,1465651.50,6,9,Test,31115544_52282837474,61356406_48058790712_830581,step_1,2017-04-03 06:02:51
238929,321523,5,70,58,U,2,127728.69,5,8,Test,392695310_40218622421,367746714_31841905860_83854,confirm,2017-04-19 13:55:50

In [26]:
df_merged_final.shape

(317123, 14)

In [33]:
# standardize the column names

df_merged_final.columns = df_merged_final.columns.str.lower()

# change column names

df_merged_final = df_merged_final.rename(columns={'gendr': 'gender'})

df_merged_final = df_merged_final.rename(columns={'bal': 'balance'})

df_merged_final.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gender,num_accts,balance,calls_6_mnth,logons_6_mnth,variation,visitor_id,visit_id,process_step,date_time
0,836976,6,73,60,U,2,45105.3,6,9,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:51:13
1,836976,6,73,60,U,2,45105.3,6,9,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:47:50
2,836976,6,73,60,U,2,45105.3,6,9,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:46:45
3,836976,6,73,60,U,2,45105.3,6,9,Test,427070339_1413275162,228976764_46825473280_96584,step_3,2017-04-02 11:23:08
4,836976,6,73,60,U,2,45105.3,6,9,Test,427070339_1413275162,228976764_46825473280_96584,step_2,2017-04-02 11:22:24

In [34]:
# export the final dataset

df_merged_final.to_csv("/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_merged_final.csv", index=False)

## Cleaning the outliers

In [59]:
df_final_cleaned = df_merged_final.copy()

df_final_cleaned.shape

(317123, 15)

In [57]:
# using IQR method for outlier cleaning

# Calculate the IQR for tenure in years and balance

Q1_tenure_yr = df['clnt_tenure_yr'].quantile(0.25)
Q3_tenure_yr = df['clnt_tenure_yr'].quantile(0.75)
IQR_tenure_yr = Q3_tenure_yr - Q1_tenure_yr
lower_bound_tenure_yr = Q1_tenure_yr - 1.5 * IQR_tenure_yr
upper_bound_tenure_yr = Q3_tenure_yr + 1.5 * IQR_tenure_yr

Q1_tenure_mnth = df['clnt_tenure_mnth'].quantile(0.25)
Q3_tenure_mnth = df['clnt_tenure_mnth'].quantile(0.75)
IQR_tenure_mnth = Q3_tenure_mnth - Q1_tenure_mnth
lower_bound_tenure_mnth = Q1_tenure_mnth - 1.5 * IQR_tenure_mnth
upper_bound_tenure_mnth = Q3_tenure_mnth + 1.5 * IQR_tenure_mnth

Q1_balance = df['balance'].quantile(0.25)
Q3_balance = df['balance'].quantile(0.75)
IQR_balance = Q3_balance - Q1_balance
lower_bound_balance = Q1_balance - 1.5 * IQR_balance
upper_bound_balance = Q3_balance + 1.5 * IQR_balance

# Filter out the outliers

cleaned_df = df[
    (df['clnt_tenure_yr'] >= lower_bound_tenure_yr) & (df['clnt_tenure_yr'] <= upper_bound_tenure_yr) &
    (df['clnt_tenure_mnth'] >= lower_bound_tenure_mnth) & (df['clnt_tenure_mnth'] <= upper_bound_tenure_mnth) &
    (df['balance'] >= lower_bound_balance) & (df['balance'] <= upper_bound_balance)
]

# Display the number of records before and after cleaning
original_count = df.shape[0]
cleaned_count = cleaned_df.shape[0]

original_count, cleaned_count

(317123, 276740)

In [61]:
# export the cleaned dataset

cleaned_df = cleaned_df.to_csv("/Users/alexandreribeiro/Desktop/Ironhacks Booty/5th week/Project/Datasets/df_cleaned.csv", index=False)